app/controllers/songs_controller.rb

  def set_song
    @song = Song.find_by_id(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]